<%@ page contentType="text/html; charset=utf-8"%>
<%--
  ~ Copyright 1998-2009 Linux.org.ru
  ~    Licensed under the Apache License, Version 2.0 (the "License");
  ~    you may not use this file except in compliance with the License.
  ~    You may obtain a copy of the License at
  ~
  ~        http://www.apache.org/licenses/LICENSE-2.0
  ~
  ~    Unless required by applicable law or agreed to in writing, software
  ~    distributed under the License is distributed on an "AS IS" BASIS,
  ~    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~    See the License for the specific language governing permissions and
  ~    limitations under the License.
  --%>

<jsp:include page="/WEB-INF/jsp/head.jsp"/>

<title>Правила LOR</title>
<jsp:include page="WEB-INF/jsp/header.jsp"/>

<div class=text>
<h1>Правила написания и модерирования комментариев</h1>
Linux.org.ru - клуб пользователей операционной системы Linux и
других Unix-систем, предназначенный для обмена интересной
информацией по тематике сайта.
Комментарии и форумы Linux.org.ru постмодерируемы,
администрация и модераторы сайта оставляют за собой право удалять сообщения
в соответствии с нижеследующими правилами.
<p>
Правила предназначены для
поддержания нормальной здоровой дискуссии в комментариях к новостям
и в форумах.
<p>
В комментариях к новостям можно обсуждать все, что имеет отношение
к исходной новости.  Пожалуйста, придерживайтесь следующих правил.
<ul>
<li>Воздержитесь от развития дискуссии вне изначальной темы.
<li>Воздержитесь от личной переписки с участниками дискуссии,
неинтересной остальным ее участникам
<li>Воздержитесь от оскорблений участников дискуссии и применения
нецензурных выражений
<li>Воздержитесь от религиозных, национальных и политических
споров
<li>Воздержитесь от обсуждения действий и бездействий модераторов
в комментариях, используете специально предназначенный для
этого <a href="group.jsp?group=4068">раздел форума</a>.
Бездействие очень часто связанно с отсутствием времени на чтение
всех сообщений. Лучшее, что вы можете сделать в случае, если
вы наткнулись на вопиющее нарушение правил, - <a href="mailto:webmaster@linux.org.ru">сообщить нам</a>
<li>Воздержитесь от ответов на некорректные сообщения и сообщения
вне темы. Игнорируя некорректные сообщения, вы препятствуете
развитию некорректной дискуссии. Не вступайте в словесные
перепалки с оскорбляющими Вас (или других участников)
сообщениями или сообщениями, содержащими нецензурные
выражения - лучше <a href="mailto:webmaster@linux.org.ru">напишите нам</a>
и мы удалим их
</ul>
<p>
Если вы хотите обсудить действия модераторов, написать комментарий или
предложение по работе сайта - воспользуйтесь специально предназначенным
для этого <a href="group.jsp?group=4068">разделом форума</a>.

<h2>Регистрация</h2>
При регистрации на сайте запрещается:
<ul>
<li>Использование нецензурных слов в имени пользователя,
<li>Использование более одного логина одним пользователем. Допускается смена
логина пользователем, при этом старое имя не должно более использоваться. Смена логина разрешается не чаще одного раза в месяц.
<li>Использование одного логина более чем одним пользователем. 
</ul>

<h2>Правила модерирования</h2>

<h3>1. Предназначение</h3>
<ol>
<li>Правила предназначены для модерирования форума и главной своей целью
имеют поддержание нормальной здоровой дискуссии в комментариях к новостям
и в форумах. 
Понятие 'здоровой' дискуссии определяется
настоящими правилами и личным мнением модераторов, основанном на опыте
управления форумами.
</ol>
<h3>2. Введение</h3>
<ol>
<li>Сообщения являются постмодерируемыми, и потому наличие конкретного
сообщения на сайте не означает его соответствия правилам.
<li>В случае несоответствия правилам сообщение может быть удалено.
Какой-либо модификации сообщений не производится. Текст новостей и подписи к
скриншотам могут быть отредактированы модераторами, в случае существенных изменений модератор оставляет подпись со своим именем и датой редактирования в тексте
сообщения.
<li>Необходимость применения или неприменения данных правил решается
модератором лично в каждом конкретном случае.
<li>У нас не всегда достаточно времени оперативно просматривать сообщения.
Если вы считаете, что какое-то конкретное сообщение нарушает правила
и должно быть удалено, сообщите нам.
</ol>
<h3>3. Технически некорректные сообщения</h3>
Технически некорректными признаются сообщения в следующих случаях:
<ol>
<li>Точные дубликаты других сообщений
<li>Несоответствие кодировки сообщения кодировке сайта
<li>Сообщения, нарушающие дизайн сайта, например слишком широкие сообщения в
режиме преформатированного текста.
<li>Пустые сообщения
</ol>
<h3>4. Сообщения вне темы обсуждения и флеймы</h3>
<ol>
<li>Сообщения, не связанные смыслом с темой обсуждения и другими комментариями.
Сообщения, связанные смыслом с другими комментариями, но не связанные
с темой обсуждения могут быть удалены по усмотрению модератора.
<li>Сообщения, содержащие вызывающе неверную либо 
вызывающе неверно интерпретированную
информацию, способную привести к развитию нездоровой дискуссии.
Мы уважаем чужое мнение, но оставляем за собой право удалять
сообщения, безаппеляционно сообщающие вызывающе неверные факты.
<li>Сообщения, провоцирующие нездоровые дискуссии.
<li>Запрещаются обсуждения действия или бездействия модераторов,
за исключением форума 'Linux-org-ru'. Оставьте модерирование
модераторам, в случае их бездействия используйте email.
<li>Тестовые сообщения
<li>Спам
<li>Флуд - регулярная отправка бессмысленных текстов
</ol>
<h3>5. Оскорбительные и личные сообщения</h3>
<ol>
<li>Сообщения, содержащие нецензурные слова
<li>Сообщения, содержащие непосредственные оскорбления конкретных участников
дискуссии или групп участников
<li>Сообщения, провоцирующие национальные и политические споры.
<li>Сообщения, неинтересные другим участникам обсуждения за исключением 2-3 человек,
т.е. сугубо личная переписка, не содержащая полезной информации для других
участников форума.
<li>Преднамеренное искажение слов, замена букв на похожие по написанию символы и буквы других языков. Преднамеренное нарушение правил русского языка. Пункт правил действует в случае, когда искаженные слова преобладают в сообщении. Пункт не распространяется на сообщения, целиком написанные в корректном "транслите".
</ol>

<h3>6. Нарушение copyright</h3>
Сообщения, содержащие информацию, публикация которой на сайте невозможна
из-за ограничений, наложенных ее авторами. В частности:
<ol>
<li>Новости с других сайтов, явным образом не разрешающих их копирование.
Если вы хотите поделиться увиденной вами новостью, перескажите
ее своими словами.
<li>Ссылки на места расположения нелегально распространяемого ПО.
<li>Ссылки на страницы, непосредственные ссылки на которые запрещены их
авторами.
</ol>

<h3>7. Другие случаи</h3>
<ol>
<li>На усмотрение модераторов вместе с некорректными сообщениями могут
быть удалены сделанные на них комментарии. Постарайтесь воздержаться от
ответа на некорректные сообщения.
</ol>
<p>

<h1>Звезды</h1>
С мая 2004 года на сайте введен расчет рейтинга активности пользователя. Рейтинг пользователя растет при участии пользователя в дискуссиях сайта и уменьшается при нарушении правил форума. <p>
Рейтинг отображается после имени пользователя в виде "звезд". После регистрации пользователь имеет нулевой рейтинг. Максимально возможный рейтинг пользователя - 5 звезд. Модераторы автоматически получают 4 звезды, однако любой пользователь может получить рейтинг вплоть до 5 звезд.<p>
Для идентификации пользователей рассчитываются две величины - <i>текущий</i> и <i>максимальный</i> рейтинг. Максимальный рейтинг - максимум текущего рейтинга за время существования пользователя. Визуально максимальный рейтинг задает количество звезд, текущий - их цвет. Текущий рейтинг отображается зеленым цветом, недостающие звезды добавляются белыми.<p>
Необходимо уточнить, что ни в коем случае не следует рассматривать рейтинг как показатель некой личной крутизны. Это лишь показатель активности человека на форуме.
<p>

<h1>Процедура выбора модераторов</h1>
Активно участвующий в форумах пользователь может стать модератором. Процедура такова:

<ul>
<li>Кандидат должен сообщить о своем желании по e-mail (пишите на maxcom &lt;собака&gt; linux.org.ru)
<li>Рейтинг должен быть минимум две (зеленых) звезды, а лучше три
<li>В истории удаленных комментариев не должно быть пунктов 5.2 и 5.3. Удаления по остальным пунктам (и в особенности 5.1) рассматриваются отдельно на предмет тяжести нарушения. История рассматривается за последние полгода.
<li>Далее кандидатура обсуждается в списке рассылки для модераторов и проводится голосование среди модераторов. Положительное решение принимается в случае
наличия как минимум двух голосов "за" и при отсутствии голосов против (т.е.
каждый модератор обладает правом "вета"). Голосование длится приблизительно 
неделю.
</ul>

<h1>Блокировка пользователей</h1>
В случае систематических нарушений пользователь может быть заблокирован:
<ul>
<li>Пользователь с нулевым рейтингом (без звезд любого цвета) может быть заблокирован автоматически при достижении определенного порога, а также по решению модератора
<li>Пользователь с рейтингом "одна звезда любого цвета" может быть заблокирован автоматически при достижении определенного порога, а также по результатам голосования модераторов
<li>Пользователь с рейтингом "две и более звезды любого цвета" может быть заблокирован по результатам голосования модераторов, автоматическое блокирование не производится.
</ul>

<h1>Фотографии и аватары</h1>
Пользователи имеют возможность разместить свою фотографию или аватар.
Разрешается отправка любых изображений, кроме:
<ul>
<li>содержащих нецензурные надписи и изображения</li>
<li>содержащих фрагменты, оскорбляющие участников дискуссии</li>
<li>провоцирующих национальные и политические споры</li>
<li>содержащих анимацию</li>
<li>нарушающих copyright автора изображения</li>
</ul>

В случае нарушения изображение может быть удалено. В случае систематических нарушений
пользователь может быть заблокирован в соответствии с пунктом "Блокировка пользователей".

<h1>Блокировка IP-адресов</h1>
Постинг сообщений с IP-адреса может быть закрыт модераторами сайта на определенный срок по следующим
причинам:
<ul>
  <li>
    Автоматический или ручной массовый постинг бессмысленных сообщений (флуд).
    Постинг может быть запрещен на любой срок, вплоть до перманентной блокировки.
    В исключительных случаях (если уже по первому сообщению можно сделать
    достоверный вывод, что это начало флуда) адрес может быть заблокирован
    на любой срок.
  </li>
  <li>
    Постинг большого количества нарушающих правила сообщений. Постинг может
    быть заблокирован на срок до одной недели. Для данного пункта требуется наличие
    хотя бы пяти удаленных сообщений, отправленных за последние сутки.
  </li>
</ul>
<p>
  Постинг на срок более суток может быть заблокирован только при наличии уверенности,
  что данный IP-адрес является постоянным. Перманентной блокировкой следует пользоваться
  только в отношении прокси-серверов, которые, как правило, не меняют своих IP адресов.
  При блокировке адреса обязательно должна быть указана причина блокирования.
</p>

<h1>Личная информация о пользователях</h1>
Модераторы сайта имеют доступ к информации о пользователе, не доступной обычным
пользователям. Следующая информация считается личной:
<ul>
  <li>e-mail пользователя, указанный при регистрации</li>
  <li>IP адрес пользователя, географическое местоположение, факт наличия
статического IP, факт наличия нескольких пользователей на этом IP</li>
  <li>используемый броузер/операционная система</li>
  <li>пароль пользователя</li>
</ul>
<p>
Модераторы сайта обязуются не разглашать данные сведения в открытый доступ.
Данные правила не распространяются на сведения, указанные пользователем в
открытом доступе (в форуме или в открытой части профиля, а так же полученные из
других открытых источников информации). Во избежание спорных ситуаций
по данному правилу модераторам рекомендуется указывать источники информации.
</p>
<p>
  Администрация сайта оставляет за собой право на публикацию статистики,
  основанной на личной информации пользователей.
</p>
<p>
$Id$

</div>
<jsp:include page="WEB-INF/jsp/footer.jsp"/>
